{"review_id": "pxOrtki0sqXps5hSyLXKpA", "user_id": "OLR4DvqFxCKLOEHqfAxpqQ", "business_id": "zK7sltLeRRioqYwgLiWUIA", "stars": 5.0, "text": "Second time I've been here. First time was whatever. This time it was actually good. Way better than inn n out. It's the same type of burger that's why I put it up against that. I love that you can get grilled jalapeños. Just wish they came on the burger and not on the side.", "date": "2015-12-19 07:35:30"}
{"review_id": "mbuuWgNmd5lBb5zzvvKl7Q", "user_id": "0XMLbsJt-fvcQsOHt3_B_Q", "business_id": "eTXYID00jGxq1vZpntBUFw", "stars": 5.0, "text": "I love this place. The service is always good. I love the vegi burger and sweet potato fries. Worth the trip there. My #1 place to go in Boulder.", "date": "2014-04-18 04:30:19"}
{"review_id": "mcruSpMn95B1Zm1bkngkEQ", "user_id": "bQCHF5rn5lMI9c5kEwCaNA", "business_id": "na4Th5DrNauOv-c43QQFvA", "stars": 3.0, "text": "Sure, the public areas are still swanky, but things evolve all the time in Vegas. While the rooms themselves are fairly comfortable, they're nowhere near as luxe as, say, the Venetian/Palazzo or the Wynn/Encore. It's simply going to be a decent, comfortable experience.\n\nAs with many Vegas hotels, they charge an extortionary \"resort fee,\" which ostensibly pays for things like wi-fi and fitness center usage that are standard at most non-Vegas hotels. Even then, you don't necessarily need the wi-fi if you have a cell phone plan with unlimited data and tethering, and you also don't necessarily need the fitness center since you'll be getting 2-3x your normal daily steps with all the endless walking that's required inside casinos and on the Strip. That having been said, the fitness center is quite nice and well-stocked.\n\nIf you're a guest, getting around the common areas of the hotel is also going to be a challenge as they're so crowded with tourists, and as the entrance to the guest rooms is buried at the rear of the casino (read: a somewhat long, crowded walk to any exit leading onto the Strip). If rates are decent here and include some sort of bonus (like a meal credit at MGM properties), then I'd stay here again. If rates are super out of line, however, than I wouldn't even bother.", "date": "2018-08-26 07:33:20"}
{"review_id": "FL9Uky4Tn4gbNsyoRBeh1A", "user_id": "-gQm-IoK2_BMEMx9OgtQnw", "business_id": "MBanyASw0fX21eHOg1m5pA", "stars": 4.0, "text": "Stopped by here today in search of one of those weighted eye masks (they didn't have any) but had not been in the store in a while. They renovated it and it is beautiful. Very clean and upscale looking with isles and isles of products. \n\nThey have a onsite salon as well and do hair, nails ext. The staff was very friendly and helpful. All in all, its a great place to go for all you beauty needs!", "date": "2010-07-21 21:53:05"}
{"review_id": "yE-6apqHFL017IU2bZUXgg", "user_id": "S6x7z26X_HdmdxwkmujlEg", "business_id": "bZMcorDrciRbjdjRyANcjA", "stars": 2.0, "text": "I should have listened to the reviews. This place is highly unprofessional. \n\nMy 1st, visit was great. Signed up for a package only needed 2 months, I was directed to cancel you have to email corporate 30 days in advance. I paid for a partial month then I was directed each month would automatically be pulled out. \n\nAt this point I have now sent 4 emails to them with no response requesting a cancel. \n\nMy 2nd visit I was recommended a lotion at 30% off for a holiday weekend special. She advised due to something I could use the lotion today but had to keep it at the store for another 2 days. Thought that was weird - but hey whatever. I went with it. Also, during my 2nd visit the 2 bulbs were out in the bed.  Lastly, I would out if I would have started my package 2 days later I would have got my following month for $1.00. That was highly disappointing. \n\nMy 3rd visit I come in pick up my lotion no problem; however I decided to ask her what the full price of the lotion was...she provided me the price after tax...which was exactly what I paid. The girls behind the desk advised I would need to go through corporate for the difference. \n\nSo far - this company is a mess. I can not believe they do not provide their front line with the proper tools to provide good customer service. \n\nShould you really trust a company that can not trust their staff to adjust a price by 30%? Or trust them to enter a cancelation. This baffles me.", "date": "2016-09-04 02:25:21"}
{"review_id": "_89nDekbE3xZEHa5bMwo7w", "user_id": "b1wjZL3EBm4h2vbeXjfcTA", "business_id": "H8umkLwMkM0vP5B8oPiozQ", "stars": 4.0, "text": "Decent service -- waiter was good; the rest of the staff could've been quicker/friendlier for a slow Friday night. 3/5 \n\nRoasted Vegetable flatbread was amazing! Very low sodium. Great vegetarian choice; next time I'll try to request no cheese on the other veg flatbread (it'll probably be excellent as well). 4.5/5", "date": "2016-09-03 19:50:38"}
{"review_id": "ornHYkkhHkD9ogap45o3wA", "user_id": "PKEzKWv_FktMm2mGPjwd0Q", "business_id": "VD0zZKG_ZEz_VYlKLtu9Zg", "stars": 5.0, "text": "Five of us gathered for a Friday night dinner at Glutton.  Chef Bradley Manchester cooked for the table and just sent out dishes from the fall menu he wanted us to try.  We got:\n\nCayenne and cheddar pork rinds\nEggplant caponata with goat cheese toast\nBrandade Rangoon with salt cod\nGuanciale flatbread\nShaved Brussels sprouts salad\nBeet salad\nJapanese street corn\nPrime flank steak\nGnocchi with pork cheek\nShort rib cavatelli\nButternut squash agnolotti\nWood roasted chicken\nTurkey and guanciale meatballs\nGrilled bread\nMaple and mascarpone cheesecake\nChurros and hot chocolate\nCaramel apple fritters\nCaramel corn profiteroles\n\nThis restaurant is well named for the food can make one become a glutton if the food here is not consumed sparingly instead of a large order like ours.  Execution of the dishes was excellent.  There was nothing from the list that I didn't think was great.\n\nStandouts--the Japanese street corn is a must get.  The shaved Brussels sprouts salad was superb and all four desserts were very good.  The gnocchi with pork cheek was sublime!\n\nService was excellent with fresh share plates and silverware being brought.  For a newer restaurant in DTLV, this is a standout among the ones I've been to.  One caveat--we had the gnocchi but that is not on the fall menu.  If it returns to the menu during another season, it's a must get!", "date": "2015-10-13 15:20:15"}